:PROPERTIES:
:ID:       d2aff89f-548f-4d12-9d41-a02fa2669eb0
:END:
#+TITLE: Workshop: GraphQL Product Taxonomy
#+CATEGORY: slips
#+TAGS:

I'm like literally trying to organize MY personal inventory using a system of
categorization which I know to be well-tested and which has some kind of
consensus (so maybe other people may be implicitly familiar with the system).

I don't actually care to reinvent the wheel here... and no, I don't have a
million dollars for labeling tape or the time to re-re-re-re-reorganize for the
50,000th time.

Why is it that: /OUR/ DATA IS /THEIR/ COMMODITY, YET WE CREATE IT AND MAY NEVER
BENEFIT FROM IT. This is ridiculous.

* Taxonomy

** Lowes
JQuery is apparently busted on Lowes website, but I would like to extract their
product taxonomy. Of course, no matter what I want to learn -- mechatronics,
CAD, art, workshop, website -- literally the first thing I want to do is extract
data to organize my thought, visualize it, design some creative endeavor or
otherwise utilize the data.

These corporations are all based on data, but they (and esp. social media) do
not make available to you the same tools or resources that they use to be
efficient. Quite the opposite, they expect you to be dumb/helpless forever
because you're more profitable that way (this isn't really /about/ lowe's per
se, so I'm not arguing that this accusation applies to them).

However! I would like to organize my own hardware at home, but I mostly know
nothing about it. Reasoning about the ontologies or taxonomies of things helps
me learn quite quickly. Here, I would like to know that I'm printing labels that
organize products descriptively & succinctly while dividing things i've *ahem*
purchased so that I can make the most efficient usage of what I have ... without
needing shop class.

For businesses like these, the optimization of their own taxonomies allows their
products to be discoverable, inventoried, analyzed and reported on. So it does
provide some level of competitive advantage. I don't want to compete, but if I
can make more efficient usage of what I have, then maybe I would purchase more.

** Home Depot

However, Home Depot has a GraphQL API

#+hdUserId
#+begin_src emacs-lisp
"4705be5b-25e7-579a-6bca-401d9040deeb"
#+end_src

#+hdParentTraceId
#+begin_src emacs-lisp
"ca32ca601707e12f12925ebb4b4c4390/10179048065165938418"
#+end_src

#+hdCookie
#+begin_src emacs-lisp
"HD_DC=origin; _abck=1D2494FCB68AE4B81A1B608EF48FF357~0~YAAQhGjcFxld21mPAQAApIFhbwvOnHbIjgOGxR5hIpvVWWnOQXXSjflF/4pEmQIG0Su5bAUiwYzm2NXuKP8ks9erMr/8Q2Ppyr4VHwcc4sbcTYus4faVBv62EF6zU8yUuoZKmtFDMlGxOB7cWTZQ8FPQWtC7XQx3WJB/ySdPxzyzL+1OuQM5EC86LJMemvbGFMsSXMWxxJ8EiUKi8qvEaKefh8JgGNE9CYtJqCAqXMURL03OWws1X/SLjIaIn2WduF40PhBXlaqTeM2e6RwEUM8+7Y/qWxPfAZewiu0jblIFQUsX8ORRi4eap6bHsXNUxM60o/1pdTmM0TCJbbRsOD+TayEYkkqtx3VG+7BE5GFQfeUKopgGu+w1EIIfpAuBxILcHIhN9A19Kxw5BvT7qMaVlA6RZBpwzMaE2Uq93t1XunRcZFk=~-1~||0||~-1; at_chec…M1yXFQ7UygKVL1pXhoXFq3XoF6elFEEKylAgSC1k/HlJ+H9YfvnrcTbaPP4j8MAGvj79lQsWvP1npq6FW19QBmNQe7fu8Pu41Q==~1; THD_NR=1; mbox=session#46ca09a8239442c78d527bbd80a02ac4#1715562497; THD_SESSION=; THD_CACHE_NAV_SESSION=; bm_sv=0B4BECF840EC9CAA0659EEFB35B6A518~YAAQhGjcF6uy21mPAQAAqXVibxcAFEmdVC9Ssz4ld60tSB6kxYMlOF7Cbb+TFdFZlZhmUQTdZ/340KJd9yjkJflogS7jQK7y0nJuekkBW9yHIY+9u8T6jI1PBK9jMk7wUhErMJ/8/nxBYxg03kecBvEnz0ocSAtJfSmj8IdI22QhRPAbR04CzsaIgXrqIJ18u4+zLgLhOtLHNwpYiGg0r7tta/rGKcObJ+H5BRiU2maqK0uvlqQU3i1Ztd4jl+RKnjQr~1"
#+end_src

#+hdCloudTraceContext
#+begin_src emacs-lisp
"5d521515ded8484d9a6ac1af906fd22b/1;o=1"
#+end_src

*** Main Categories

To process the result with =jq=, include =:jq .= in the headers.

... Now i'm getting "forbidden" again. My cookies probably expired. This is
seriously exhausting. It's probably faster just to:

+ record the responses in a web session
+ then save HAR file, then unpack the archive
+ delete all files except those corresponding to =/graphql= endpoint requests.
+ extract the HTTP/2 Response data from those requests.
+ compare to the category ID's i've saved here
+ reconstruct the tree from GraphQL ID references.

#+name: hdL2
#+begin_src restclient :results output  :cache yes :jq .
POST https://apionline.homedepot.com/federation-gateway/graphql?opname=headers
Content-Type: application/json
Host: apionline.homedepot.com
Origin: https://www.homedepot.com
Pragma: no-cache
Referer: https://www.homedepot.com
User-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:125.0) Gecko/20100101 Firefox/125.0
Cookie: <<hdCookie()>>
X-Api-Cookies: {"x-user-id":"<<hdUserId()>>"}
X-Cloud-Trace-Context: <<hdCloudTraceContext()>
X-Parent-Trace-Id: <<hdParentTraceId()>>

{
	"operationName": "headers",
	"query": "query headers($id: String!, $componentClass: HeaderComponents!) {\n  headers(id: $id, componentClass: $componentClass) {\n    ... on PrimaryNavigationL1 {\n      id\n      componentName\n      title\n      subtitle\n      link\n      icon\n      previewImage {\n        damDownloadedContent {\n          url\n          __typename\n        }\n        __typename\n      }\n      level {\n        id\n        componentName\n        primaryNavigation {\n          id\n          componentName\n          title\n          subtitle\n          link\n          icon\n          previewImage {\n            damDownloadedContent {\n              url\n              __typename\n            }\n            __typename\n          }\n          level {\n            id\n            componentName\n            __typename\n          }\n          __typename\n        }\n        __typename\n      }\n      __typename\n    }\n    ... on PrimaryNavigationL2 {\n      id\n      componentName\n      title\n      subtitle\n      link\n      icon\n      previewImage {\n        damDownloadedContent {\n          url\n          __typename\n        }\n        __typename\n      }\n      level {\n        id\n        componentName\n        primaryNavigation {\n          id\n          componentName\n          title\n          subtitle\n          link\n          icon\n          previewImage {\n            damDownloadedContent {\n              url\n              __typename\n            }\n            __typename\n          }\n          level {\n            id\n            componentName\n            __typename\n          }\n          __typename\n        }\n        __typename\n      }\n      __typename\n    }\n    ... on PrimaryNavigationL3 {\n      id\n      componentName\n      title\n      subtitle\n      link\n      icon\n      previewImage {\n        damDownloadedContent {\n          url\n          __typename\n        }\n        __typename\n      }\n      level {\n        id\n        componentName\n        primaryNavigation {\n          id\n          componentName\n          title\n          subtitle\n          link\n          icon\n          previewImage {\n            damDownloadedContent {\n              url\n              __typename\n            }\n            __typename\n          }\n          level {\n            id\n            componentName\n            __typename\n          }\n          __typename\n        }\n        __typename\n      }\n      __typename\n    }\n    ... on PrimaryNavigationL4 {\n      id\n      componentName\n      title\n      subtitle\n      link\n      icon\n      previewImage {\n        damDownloadedContent {\n          url\n          __typename\n        }\n        __typename\n      }\n      level {\n        id\n        componentName\n        primaryNavigation {\n          id\n          componentName\n          title\n          subtitle\n          link\n          icon\n          previewImage {\n            damDownloadedContent {\n              url\n              __typename\n            }\n            __typename\n          }\n          __typename\n        }\n        __typename\n      }\n      __typename\n    }\n    ... on PrimaryNavigationL5 {\n      id\n      componentName\n      title\n      subtitle\n      link\n      icon\n      previewImage {\n        damDownloadedContent {\n          url\n          __typename\n        }\n        __typename\n      }\n      __typename\n    }\n    __typename\n  }\n}",
	"variables": {
		"componentClass": "PrimaryNavigationL2",
		"id": "1BDh5E1pOmmWNMc7CHdLxj"
	}
}
#+end_src

#+RESULTS[904f4aa19073d6a9b2328dbd876c60ac353bba6b]: hdL2
#+BEGIN_SRC js
{
  "timestamp": "2024-05-13T01:25:25.490+00:00",
  "path": "/federation-gateway/graphql",
  "status": 403,
  "error": "Forbidden",
  "requestId": "45a54b0c-20163468"
}
#+END_SRC

Rework API response

# +headers: :results output code :wrap src json  :in-file /tmp/hdL2.json

#+name: hdL2jq
#+headers: :results output code :wrap src json
#+begin_src jq :stdin hdL2 :cmd-line "-rj"
.data.headers.level.primaryNavigation[]
  | {id,title,levelId: .level.id,levelComponentName: .level.componentName}
#  | [.id, .title, .level.id, .level.componentName]

#+end_src

#+RESULTS: hdL2jq
#+begin_src json
{
  "id": "1WzEG1m6Q4uGb1Sl04qQOk",
  "title": "Appliances",
  "levelId": "LFRJg6tOOaoNSi4liQ4d0",
  "levelComponentName": "Level4"
}
{
  "id": "5SR1tzHpMCDvGf0aI8cuMV",
  "title": "Bath & Faucets",
  "levelId": "4pfnGWeGXdoFtSfAZxHg0U",
  "levelComponentName": "Level4"
}
{
  "id": "73RUuOeOISPkLs7lWDVPMs",
  "title": "Blinds & Window Treatments",
  "levelId": "1ZPT3nfks9XepwBC0jZA0c",
  "levelComponentName": "Level4"
}
{
  "id": "2i48VKFIG9IWLII4NV86da",
  "title": "Building Materials",
  "levelId": "5wbPosBMQ3HdwWW0dkSaXY",
  "levelComponentName": "Level4"
}
{
  "id": "3Zva9p8g8IhuZTXLfiwCwU",
  "title": "Cleaning",
  "levelId": "7Gc5hMj0YPEvr7W4RQteed",
  "levelComponentName": "Level4"
}
{
  "id": "1yoyI5hxsyRUI0ZKq98Dmr",
  "title": "Decor & Furniture",
  "levelId": "7xGz0jmSeuxMJDiD5tAa0S",
  "levelComponentName": "Level4"
}
{
  "id": "1SSKzoX1ch30sQ47RPpufU",
  "title": "Doors & Windows",
  "levelId": "79OhpsJAo5wOCONf1Z6Cw4",
  "levelComponentName": "Level4"
}
{
  "id": "7GFzJm7aBiwYoCBiPaXTGx",
  "title": "Electrical",
  "levelId": "50REX1FmpUrreHZdkskJGb",
  "levelComponentName": "Level4"
}
{
  "id": "1zfe1oFPnejOInfWvqrLpE",
  "title": "Flooring, Tile, & Rugs",
  "levelId": "4Yku2UQ8LGyTFgC3iQ2K99",
  "levelComponentName": "Level4"
}
{
  "id": "ACHM3q1CBGGwSo3MquohG",
  "title": "Hardware",
  "levelId": "5UB0ywkGWEZ0DEps9A8BBO",
  "levelComponentName": "Level4"
}
{
  "id": "5mTrtGpYeRGQNyXudbwaVY",
  "title": "Heating, Cooling, & Air Quality",
  "levelId": "3sfneadH9yZgM77enqVLbZ",
  "levelComponentName": "Level4"
}
{
  "id": "3sxkf1DQAepQr5Adci8AMq",
  "title": "Holiday Decorations",
  "levelId": "5czhsseD4jNz5m1lKPZ1y2",
  "levelComponentName": "Level4"
}
{
  "id": "6wZ5GqwsMKZDNby6AJQcZu",
  "title": "Kitchen & Kitchenware",
  "levelId": "5JbwKP97kZOCP4PDAnR4pl",
  "levelComponentName": "Level4"
}
{
  "id": "6rqVaG34UukNJAl1V9gIq0",
  "title": "Lawn & Garden",
  "levelId": "1HjiKAijdoRCYIE9BBocJb",
  "levelComponentName": "Level4"
}
{
  "id": "79l6fibZ2wajSf4w2oEYWR",
  "title": "Lighting & Ceiling Fans",
  "levelId": "1lEdCMTh1fY4c5wr9SOsiv",
  "levelComponentName": "Level4"
}
{
  "id": "7MrekgRZ4TOI0xAAY3Vwkf",
  "title": "Outdoor Living & Patio",
  "levelId": "4JczPBCCVJsBgAEsnTolFS",
  "levelComponentName": "Level4"
}
{
  "id": "67ZimwQYnTW1rmUeYp5OzU",
  "title": "Paint",
  "levelId": "3VJx94pElndvZg0v1Kxvcx",
  "levelComponentName": "Level4"
}
{
  "id": "5u78hRRCgWXHgXUVW3ekno",
  "title": "Plumbing",
  "levelId": "1dwfLX93OslwzGmfyhQiVb",
  "levelComponentName": "Level4"
}
{
  "id": "6ytt058YntqWJ3RxVXm79q",
  "title": "Smart Home",
  "levelId": "zbNTjSepqGyY64RLCO1fs",
  "levelComponentName": "Level4"
}
{
  "id": "vFHNb2SnyF6paCABpN5Dc",
  "title": "Storage & Organization",
  "levelId": "6vsytUXv2XF9wqbG93s7jz",
  "levelComponentName": "Level4"
}
{
  "id": "4LnjbM4InXNfHjmkuKLnUw",
  "title": "Tools",
  "levelId": "4e05QUPN1h0Fu6VlsOZBHR",
  "levelComponentName": "Level4"
}
#+end_src

* Round Two

The site map also contains a decent list of categories, but parsing it requires
iterating through several redirects:

+ https://www.homedepot.com/sitemap.xml
+ https://www.homedepot.com/sitemap/Cat.xml
+ https://www.homedepot.com/sitemap/Cat/cat-0.xml

Fortunately, it's pretty safe to say that this last URL won't change much. I
only really need one copy of the taxonomy anyways.

Finally you get to a list of URL's to pages where you can run the following
JQuery to retrieve a list of unique names for leaf categories. You'd need some
other way to extract the sidebar div's content, other than its ID since that's
hashed... (so your neofeudalist lord's data is safe).

#+begin_example javascript
$('#SideNavigation-1-sbgUGuRB2zI9LDaALhTb0 ul').childNodes.forEach((el) => console.log(el.innerText))
#+end_example

Options for doing this include:

+ Scrapy: run JS from oldass python, eww
+ Playwright: run JS from JS or python ... slightly less ick

You will likely need to forge a lot of the tokens/useragent stuff (and hopefully
you don't actually need to track state for that shit)

** Sitemap

This somewhat works, but:

+ not only does it require templating out a project where the boilerplate is
  highly dependent on the data's *structure and source*
+ but their sitemap does not have the same structure of categorization that the rest of
  their site uses.

Also, their sitemap does NOT point to a publicly accessible site (for anyone
except robots and programmers)

Also (for my own reference) the secret password for using =ob-restclient= to
process XML is: =:results output value :wrap :noheaders t=. Anything else and it
will either wrap results in a =BEGIN_SRC= block (which is absolutely
unnecessary) or it will leave you with a result block that does not collapse.

#+name: hdSitemapCat0
#+begin_src restclient :results output value :wrap :noheaders t
GET https://www.homedepot.com/sitemap/Cat/cat-0.xml
#+end_src

#+RESULTS: hdSitemapCat0
#+begin_results
<urlset xmlns="http://www.sitemaps.org/schemas/sitemap/0.9">
  <url>
    <loc>https://www.homedepot.com/b/Plumbing-Plumbing-Parts-Faucet-Parts/N-5yc1vZc6a9</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Hardware-Mailboxes/N-5yc1vZc8f5</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Building-Materials-Ceilings/N-5yc1vZc58i</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lighting-Light-Bulbs/N-5yc1vZbmbu</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Doors-Windows-Windows/N-5yc1vZaq1w</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Electrical-Electrical-Cords/N-5yc1vZc4mz</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances-Small-Kitchen-Appliances/N-5yc1vZbv48</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Paint-Exterior-Wood-Coatings/N-5yc1vZbbbr</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Plumbing-Pipe-Fittings/N-5yc1vZbqpf</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Tools-Air-Compressor-Tools/N-5yc1vZc2fh</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances-Appliance-Parts/N-5yc1vZc35v</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Building-Materials-Insulation/N-5yc1vZasbs</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Kitchen-Kitchen-Cabinets/N-5yc1vZas87</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Watering-Irrigation/N-5yc1vZbx5o</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Paint-Interior-Paint/N-5yc1vZbbbp</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Paint-Interior-Wood-Stains/N-5yc1vZbo8p</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Building-Materials-Drywall/N-5yc1vZar3d</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Window-Treatments-Blinds/N-5yc1vZch24</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Holiday-Decorations-Christmas-Decorations-Christmas-Trees/N-5yc1vZc3rz</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath-Bathroom-Vanities/N-5yc1vZcfv3</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Window-Treatments-Window-Shades/N-5yc1vZch27</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Paint-Exterior-Paint/N-5yc1vZcg5u</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Home-Decor-Wallpaper/N-5yc1vZbc0q</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Heating-Venting-Cooling-Air-Conditioners/N-5yc1vZc4me</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Kitchen-Kitchen-Faucets/N-5yc1vZar0k</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Pools-Pool-Supplies/N-5yc1vZ1z18gxc</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Building-Materials-Ventilation/N-5yc1vZc4mr</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath-Bathroom-Sinks/N-5yc1vZbzb0</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath-Toilets/N-5yc1vZbzbd</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Plumbing-Plumbing-Parts/N-5yc1vZbqkp</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Holiday-Decorations-Halloween-Decorations/N-5yc1vZc2ve</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Heating-Venting-Cooling-Mini-Split-Air-Conditioners/N-5yc1vZc4m1</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Hardware-Door-Hardware/N-5yc1vZc213</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Heating-Venting-Cooling-Heaters-Space-Heaters/N-5yc1vZc4lh</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances-Washers-Dryers/N-5yc1vZc3ol</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Cooking-Outdoor-Kitchens/N-5yc1vZc4po</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Heating-Venting-Cooling/N-5yc1vZc4k8</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Tools-Woodworking-Tools/N-5yc1vZc2gv</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants-Trees/N-5yc1vZc8rq</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Storage-Organization-Shelving/N-5yc1vZc89k</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath-Bathroom-Faucets/N-5yc1vZbreo</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Hardware/N-5yc1vZc21m</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Building-Materials-Moulding-Millwork/N-5yc1vZaq4y</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances-Ranges/N-5yc1vZc3o9</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Tools-Hand-Tools/N-5yc1vZc1zg</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath-Bathroom-Faucets-Bathroom-Sink-Faucets/N-5yc1vZc8d3</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Storage-Organization-Garage-Storage/N-5yc1vZarmi</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Landscaping-Supplies/N-5yc1vZbx51</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Electrical-Wiring-Devices-Light-Controls/N-5yc1vZc34h</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Doors-Windows-Exterior-Shutters/N-5yc1vZarch</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Flooring/N-5yc1vZaq7r</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances-Dishwashers/N-5yc1vZc3po</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances/N-5yc1vZbv1w</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Trimmers-Edgers/N-5yc1vZbxbh</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Chainsaws/N-5yc1vZbxam</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Garden-Tools/N-5yc1vZbx6x</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Automotive-Mechanics-Tools/N-5yc1vZclb1</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Hardware-Cabinet-Hardware/N-5yc1vZc29z</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Flooring-Tile/N-5yc1vZar0y</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Plumbing-Water-Pumps/N-5yc1vZbqlb</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Lawn-Care/N-5yc1vZbx8a</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants-Garden-Flowers-Rose-Bushes/N-5yc1vZc8rd</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lighting-Flush-Mount-Ceiling-Lights/N-5yc1vZc7nk</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath/N-5yc1vZbzb3</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Holiday-Decorations-Christmas-Decorations-Indoor-Christmas-Decorations/N-5yc1vZc3rv</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances-Refrigerators/N-5yc1vZc3pi</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath-Bathtubs/N-5yc1vZbzb7</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Holiday-Decorations/N-5yc1vZbd6e</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants-Garden-Flowers-Annuals/N-5yc1vZc8rm</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors/N-5yc1vZbx82</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Generators/N-5yc1vZbx8l</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Building-Materials-Ladders/N-5yc1vZaqnp</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Planters/N-5yc1vZbx81</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lighting-Recessed-Lighting/N-5yc1vZc7ni</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Indoor-Plants/N-5yc1vZc8rn</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Workwear/N-5yc1vZc4ot</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Tools-Power-Tool-Accessories/N-5yc1vZc246</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lumber-Composites-Fencing-Gates/N-5yc1vZbrk7</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Flooring-Laminate-Flooring/N-5yc1vZare1</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Heating-Venting-Cooling-Thermostats/N-5yc1vZc4lf</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Electrical-Electronics/N-5yc1vZc958</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Tools/N-5yc1vZc1xy</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Paint/N-5yc1vZar2d</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lighting-Outdoor-Lighting/N-5yc1vZc7qv</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Automotive/N-5yc1vZc8o1</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Plumbing-Plumbing-Tools/N-5yc1vZbqlq</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lighting-Chandeliers/N-5yc1vZc7o0</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Cooking-Grills/N-5yc1vZbxaz</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center/N-5yc1vZbx6k</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances-Freezers/N-5yc1vZc3p2</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath-Showers/N-5yc1vZbzcd</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Doors-Windows-Exterior-Doors/N-5yc1vZas82</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Health-And-Wellness-Independent-Living/N-5yc1vZ2fkon56</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Riding-Lawn-Mowers/N-5yc1vZc5ax</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants-Edible-Garden/N-5yc1vZcg6h</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Heating-Venting-Cooling-Fireplaces/N-5yc1vZc4lb</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Pools/N-5yc1vZcfyr</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Cooking/N-5yc1vZcfb7</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Hardware-Fasteners/N-5yc1vZc255</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Storage-Organization-Outdoor-Storage/N-5yc1vZbu96</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Cleaning/N-5yc1vZbqsi</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants/N-5yc1vZc8rg</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Home-Spas/N-5yc1vZcfye</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Electrical-Electrical-Tools/N-5yc1vZbmc2</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Tools-Power-Tools-Drills/N-5yc1vZc27f</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Snow-Removal-Equipment/N-5yc1vZbxau</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Pet-Supplies-Wildlife/N-5yc1vZc4u1</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Holiday-Decorations-Christmas-Decorations-Christmas-Greenery/N-5yc1vZc3tk</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Kitchen-Kitchen-Sinks/N-5yc1vZarsa</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Heating-Venting-Cooling-Air-Filters/N-5yc1vZc4kw</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Heating/N-5yc1vZc6ne</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Flooring-Carpet/N-5yc1vZarl0</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Tools-Power-Tools/N-5yc1vZc298</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Kitchen/N-5yc1vZar4i</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Home-Decor/N-5yc1vZas6p</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Flooring-Hardwood-Flooring/N-5yc1vZaq8x</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath-Bathroom-Accessories/N-5yc1vZcfvt</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Electrical-Wall-Plates/N-5yc1vZbm8m</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Plumbing-Water-Heaters/N-5yc1vZbqly</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Electrical-Fire-Safety/N-5yc1vZbmgb</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Tools-Tool-Storage/N-5yc1vZc22e</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Tools-Power-Tools-Saws/N-5yc1vZc28l</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Storage-Organization-Moving-Supplies/N-5yc1vZc89r</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment/N-5yc1vZbx5c</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lighting/N-5yc1vZbvn5</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Playground-Sets/N-5yc1vZcjcd</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Building-Materials-Concrete-Cement-Masonry/N-5yc1vZarlk</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Electrical-Power-Distribution/N-5yc1vZbm0k</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Storage-Organization-Closet-Organizers/N-5yc1vZc1x1</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath-Bathroom-Safety/N-5yc1vZ1z18i4t</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Doors-Windows/N-5yc1vZaqih</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Kitchen-Kitchenware/N-5yc1vZaqzo</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances-Wall-Ovens/N-5yc1vZc3nq</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Furniture-Bedroom-Furniture-Mattresses/N-5yc1vZc7oe</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Home-Decor-Home-Accents/N-5yc1vZar58</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Plumbing/N-5yc1vZbqew</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Fathers-Day-Gifts/N-5yc1vZ1z1ze4k</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Window-Treatments-Plantation-Shutters/N-5yc1vZar29</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances-Cooktops/N-5yc1vZc3oq</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Electrical-Home-Security/N-5yc1vZc1tg</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Home-Decor-Bedding/N-5yc1vZci04</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Safety-Equipment/N-5yc1vZc4ow</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Hardware-Door-Hardware-Door-Knobs-Passage-Door-Knobs/N-5yc1vZc2gf</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Flooring-Vinyl-Flooring/N-5yc1vZapwr</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants-Garden-Flowers-Perennials/N-5yc1vZc8ry</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Building-Materials/N-5yc1vZaqns</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Flooring-Rugs/N-5yc1vZarfm</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lumber-Composites/N-5yc1vZbqpg</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Window-Treatments/N-5yc1vZar4w</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Holiday-Decorations-Christmas-Decorations/N-5yc1vZcgxo</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Furniture/N-5yc1vZc7pc</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Paint-Spray-Paint/N-5yc1vZapz5</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lumber-Composites-Decking/N-5yc1vZbqmg</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lighting-Lamps/N-5yc1vZc7pd</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Kitchen-Tableware-Bar/N-5yc1vZc4c1</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Pest-Control/N-5yc1vZbx4w</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Sports-Outdoors/N-5yc1vZc43l</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Bath-Bathroom-Exhaust-Fans/N-5yc1vZc4ly</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Home-Decor-Wall-Decor-Wall-Art/N-5yc1vZbbzh</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Automotive-Shop-Equipment/N-5yc1vZc8mr</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Storage-Organization/N-5yc1vZas7e</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Electrical/N-5yc1vZarcd</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Flooring-Flooring-Supplies/N-5yc1vZcdu0</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Pressure-Washers/N-5yc1vZbxbe</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Smart-Home/N-5yc1vZc1jw</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Lighting-Ceiling-Fans/N-5yc1vZbvlq</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Appliances-Range-Hoods/N-5yc1vZc3nk</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Kitchen-Countertops/N-5yc1vZbmf2</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Home-Decorators-Collection/N-5yc1vZ4vr</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Heating-Venting-Cooling-Heaters/N-5yc1vZc4l7</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Patio-Furniture/N-5yc1vZbx4o</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Doors-Windows-Interior-Doors/N-5yc1vZc5io</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Home-Decor-Wall-Decor/N-5yc1vZar8x</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Hydroponic-Gardening/N-5yc1vZceo9</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Decor/N-5yc1vZc6o0</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Holiday-Decorations-Christmas-Decorations-Christmas-Lights/N-5yc1vZc3tb</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Electrical-Electrical-Boxes-Conduit-Fittings/N-5yc1vZbm4m</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Paint-Paint-Supplies/N-5yc1vZci1w</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Kitchen-Kitchen-Storage-Organization/N-5yc1vZapu6</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
  <url>
    <loc>https://www.homedepot.com/b/Tools-Welding-Soldering/N-5yc1vZc8lp</loc>
    <lastmod>2024-05-12</lastmod>
  </url>
</urlset>
#+end_results

Extract URL's

#+name: hdSitemapCat
#+begin_src sh :results output :stdin hdSitemapCat0
xq  -y '.urlset | .url | map(@text "\(.loc)") | join(",")' \
    | tr ',' '\n' | sort
#+end_src

#+RESULTS: hdSitemapCat
#+begin_example
...
https://www.homedepot.com/b/Appliances-Appliance-Parts/N-5yc1vZc35v
https://www.homedepot.com/b/Appliances-Cooktops/N-5yc1vZc3oq
https://www.homedepot.com/b/Appliances-Dishwashers/N-5yc1vZc3po
https://www.homedepot.com/b/Appliances-Freezers/N-5yc1vZc3p2
https://www.homedepot.com/b/Appliances/N-5yc1vZbv1w
https://www.homedepot.com/b/Appliances-Range-Hoods/N-5yc1vZc3nk
https://www.homedepot.com/b/Appliances-Ranges/N-5yc1vZc3o9
https://www.homedepot.com/b/Appliances-Refrigerators/N-5yc1vZc3pi
https://www.homedepot.com/b/Appliances-Small-Kitchen-Appliances/N-5yc1vZbv48
https://www.homedepot.com/b/Appliances-Wall-Ovens/N-5yc1vZc3nq
https://www.homedepot.com/b/Appliances-Washers-Dryers/N-5yc1vZc3ol
https://www.homedepot.com/b/Automotive-Mechanics-Tools/N-5yc1vZclb1
https://www.homedepot.com/b/Automotive/N-5yc1vZc8o1
https://www.homedepot.com/b/Automotive-Shop-Equipment/N-5yc1vZc8mr
https://www.homedepot.com/b/Bath-Bathroom-Accessories/N-5yc1vZcfvt
https://www.homedepot.com/b/Bath-Bathroom-Exhaust-Fans/N-5yc1vZc4ly
https://www.homedepot.com/b/Bath-Bathroom-Faucets-Bathroom-Sink-Faucets/N-5yc1vZc8d3
https://www.homedepot.com/b/Bath-Bathroom-Faucets/N-5yc1vZbreo
https://www.homedepot.com/b/Bath-Bathroom-Safety/N-5yc1vZ1z18i4t
https://www.homedepot.com/b/Bath-Bathroom-Sinks/N-5yc1vZbzb0
https://www.homedepot.com/b/Bath-Bathroom-Vanities/N-5yc1vZcfv3
https://www.homedepot.com/b/Bath-Bathtubs/N-5yc1vZbzb7
https://www.homedepot.com/b/Bath/N-5yc1vZbzb3
https://www.homedepot.com/b/Bath-Showers/N-5yc1vZbzcd
https://www.homedepot.com/b/Bath-Toilets/N-5yc1vZbzbd
https://www.homedepot.com/b/Building-Materials-Ceilings/N-5yc1vZc58i
https://www.homedepot.com/b/Building-Materials-Concrete-Cement-Masonry/N-5yc1vZarlk
https://www.homedepot.com/b/Building-Materials-Drywall/N-5yc1vZar3d
https://www.homedepot.com/b/Building-Materials-Insulation/N-5yc1vZasbs
https://www.homedepot.com/b/Building-Materials-Ladders/N-5yc1vZaqnp
https://www.homedepot.com/b/Building-Materials-Moulding-Millwork/N-5yc1vZaq4y
https://www.homedepot.com/b/Building-Materials/N-5yc1vZaqns
https://www.homedepot.com/b/Building-Materials-Ventilation/N-5yc1vZc4mr
https://www.homedepot.com/b/Cleaning/N-5yc1vZbqsi
https://www.homedepot.com/b/Doors-Windows-Exterior-Doors/N-5yc1vZas82
https://www.homedepot.com/b/Doors-Windows-Exterior-Shutters/N-5yc1vZarch
https://www.homedepot.com/b/Doors-Windows-Interior-Doors/N-5yc1vZc5io
https://www.homedepot.com/b/Doors-Windows/N-5yc1vZaqih
https://www.homedepot.com/b/Doors-Windows-Windows/N-5yc1vZaq1w
https://www.homedepot.com/b/Electrical-Electrical-Boxes-Conduit-Fittings/N-5yc1vZbm4m
https://www.homedepot.com/b/Electrical-Electrical-Cords/N-5yc1vZc4mz
https://www.homedepot.com/b/Electrical-Electrical-Tools/N-5yc1vZbmc2
https://www.homedepot.com/b/Electrical-Electronics/N-5yc1vZc958
https://www.homedepot.com/b/Electrical-Fire-Safety/N-5yc1vZbmgb
https://www.homedepot.com/b/Electrical-Home-Security/N-5yc1vZc1tg
https://www.homedepot.com/b/Electrical/N-5yc1vZarcd
https://www.homedepot.com/b/Electrical-Power-Distribution/N-5yc1vZbm0k
https://www.homedepot.com/b/Electrical-Wall-Plates/N-5yc1vZbm8m
https://www.homedepot.com/b/Electrical-Wiring-Devices-Light-Controls/N-5yc1vZc34h
https://www.homedepot.com/b/Fathers-Day-Gifts/N-5yc1vZ1z1ze4k
https://www.homedepot.com/b/Flooring-Carpet/N-5yc1vZarl0
https://www.homedepot.com/b/Flooring-Flooring-Supplies/N-5yc1vZcdu0
https://www.homedepot.com/b/Flooring-Hardwood-Flooring/N-5yc1vZaq8x
https://www.homedepot.com/b/Flooring-Laminate-Flooring/N-5yc1vZare1
https://www.homedepot.com/b/Flooring/N-5yc1vZaq7r
https://www.homedepot.com/b/Flooring-Rugs/N-5yc1vZarfm
https://www.homedepot.com/b/Flooring-Tile/N-5yc1vZar0y
https://www.homedepot.com/b/Flooring-Vinyl-Flooring/N-5yc1vZapwr
https://www.homedepot.com/b/Furniture-Bedroom-Furniture-Mattresses/N-5yc1vZc7oe
https://www.homedepot.com/b/Furniture/N-5yc1vZc7pc
https://www.homedepot.com/b/Hardware-Cabinet-Hardware/N-5yc1vZc29z
https://www.homedepot.com/b/Hardware-Door-Hardware-Door-Knobs-Passage-Door-Knobs/N-5yc1vZc2gf
https://www.homedepot.com/b/Hardware-Door-Hardware/N-5yc1vZc213
https://www.homedepot.com/b/Hardware-Fasteners/N-5yc1vZc255
https://www.homedepot.com/b/Hardware-Mailboxes/N-5yc1vZc8f5
https://www.homedepot.com/b/Hardware/N-5yc1vZc21m
https://www.homedepot.com/b/Health-And-Wellness-Independent-Living/N-5yc1vZ2fkon56
https://www.homedepot.com/b/Heating-Venting-Cooling-Air-Conditioners/N-5yc1vZc4me
https://www.homedepot.com/b/Heating-Venting-Cooling-Air-Filters/N-5yc1vZc4kw
https://www.homedepot.com/b/Heating-Venting-Cooling-Fireplaces/N-5yc1vZc4lb
https://www.homedepot.com/b/Heating-Venting-Cooling-Heaters/N-5yc1vZc4l7
https://www.homedepot.com/b/Heating-Venting-Cooling-Heaters-Space-Heaters/N-5yc1vZc4lh
https://www.homedepot.com/b/Heating-Venting-Cooling-Mini-Split-Air-Conditioners/N-5yc1vZc4m1
https://www.homedepot.com/b/Heating-Venting-Cooling/N-5yc1vZc4k8
https://www.homedepot.com/b/Heating-Venting-Cooling-Thermostats/N-5yc1vZc4lf
https://www.homedepot.com/b/Holiday-Decorations-Christmas-Decorations-Christmas-Greenery/N-5yc1vZc3tk
https://www.homedepot.com/b/Holiday-Decorations-Christmas-Decorations-Christmas-Lights/N-5yc1vZc3tb
https://www.homedepot.com/b/Holiday-Decorations-Christmas-Decorations-Christmas-Trees/N-5yc1vZc3rz
https://www.homedepot.com/b/Holiday-Decorations-Christmas-Decorations-Indoor-Christmas-Decorations/N-5yc1vZc3rv
https://www.homedepot.com/b/Holiday-Decorations-Christmas-Decorations/N-5yc1vZcgxo
https://www.homedepot.com/b/Holiday-Decorations-Halloween-Decorations/N-5yc1vZc2ve
https://www.homedepot.com/b/Holiday-Decorations/N-5yc1vZbd6e
https://www.homedepot.com/b/Home-Decorators-Collection/N-5yc1vZ4vr
https://www.homedepot.com/b/Home-Decor-Bedding/N-5yc1vZci04
https://www.homedepot.com/b/Home-Decor-Home-Accents/N-5yc1vZar58
https://www.homedepot.com/b/Home-Decor/N-5yc1vZas6p
https://www.homedepot.com/b/Home-Decor-Wall-Decor/N-5yc1vZar8x
https://www.homedepot.com/b/Home-Decor-Wall-Decor-Wall-Art/N-5yc1vZbbzh
https://www.homedepot.com/b/Home-Decor-Wallpaper/N-5yc1vZbc0q
https://www.homedepot.com/b/Kitchen-Countertops/N-5yc1vZbmf2
https://www.homedepot.com/b/Kitchen-Kitchen-Cabinets/N-5yc1vZas87
https://www.homedepot.com/b/Kitchen-Kitchen-Faucets/N-5yc1vZar0k
https://www.homedepot.com/b/Kitchen-Kitchen-Sinks/N-5yc1vZarsa
https://www.homedepot.com/b/Kitchen-Kitchen-Storage-Organization/N-5yc1vZapu6
https://www.homedepot.com/b/Kitchen-Kitchenware/N-5yc1vZaqzo
https://www.homedepot.com/b/Kitchen/N-5yc1vZar4i
https://www.homedepot.com/b/Kitchen-Tableware-Bar/N-5yc1vZc4c1
https://www.homedepot.com/b/Lighting-Ceiling-Fans/N-5yc1vZbvlq
https://www.homedepot.com/b/Lighting-Chandeliers/N-5yc1vZc7o0
https://www.homedepot.com/b/Lighting-Flush-Mount-Ceiling-Lights/N-5yc1vZc7nk
https://www.homedepot.com/b/Lighting-Lamps/N-5yc1vZc7pd
https://www.homedepot.com/b/Lighting-Light-Bulbs/N-5yc1vZbmbu
https://www.homedepot.com/b/Lighting/N-5yc1vZbvn5
https://www.homedepot.com/b/Lighting-Outdoor-Lighting/N-5yc1vZc7qv
https://www.homedepot.com/b/Lighting-Recessed-Lighting/N-5yc1vZc7ni
https://www.homedepot.com/b/Lumber-Composites-Decking/N-5yc1vZbqmg
https://www.homedepot.com/b/Lumber-Composites-Fencing-Gates/N-5yc1vZbrk7
https://www.homedepot.com/b/Lumber-Composites/N-5yc1vZbqpg
https://www.homedepot.com/b/Outdoors-Garden-Center-Garden-Tools/N-5yc1vZbx6x
https://www.homedepot.com/b/Outdoors-Garden-Center-Hydroponic-Gardening/N-5yc1vZceo9
https://www.homedepot.com/b/Outdoors-Garden-Center-Indoor-Plants/N-5yc1vZc8rn
https://www.homedepot.com/b/Outdoors-Garden-Center-Landscaping-Supplies/N-5yc1vZbx51
https://www.homedepot.com/b/Outdoors-Garden-Center-Lawn-Care/N-5yc1vZbx8a
https://www.homedepot.com/b/Outdoors-Garden-Center/N-5yc1vZbx6k
https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Decor/N-5yc1vZc6o0
https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants-Edible-Garden/N-5yc1vZcg6h
https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants-Garden-Flowers-Annuals/N-5yc1vZc8rm
https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants-Garden-Flowers-Perennials/N-5yc1vZc8ry
https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants-Garden-Flowers-Rose-Bushes/N-5yc1vZc8rd
https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants/N-5yc1vZc8rg
https://www.homedepot.com/b/Outdoors-Garden-Center-Outdoor-Plants-Trees/N-5yc1vZc8rq
https://www.homedepot.com/b/Outdoors-Garden-Center-Pest-Control/N-5yc1vZbx4w
https://www.homedepot.com/b/Outdoors-Garden-Center-Planters/N-5yc1vZbx81
https://www.homedepot.com/b/Outdoors-Garden-Center-Watering-Irrigation/N-5yc1vZbx5o
https://www.homedepot.com/b/Outdoors-Home-Spas/N-5yc1vZcfye
https://www.homedepot.com/b/Outdoors/N-5yc1vZbx82
https://www.homedepot.com/b/Outdoors-Outdoor-Cooking-Grills/N-5yc1vZbxaz
https://www.homedepot.com/b/Outdoors-Outdoor-Cooking/N-5yc1vZcfb7
https://www.homedepot.com/b/Outdoors-Outdoor-Cooking-Outdoor-Kitchens/N-5yc1vZc4po
https://www.homedepot.com/b/Outdoors-Outdoor-Heating/N-5yc1vZc6ne
https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Chainsaws/N-5yc1vZbxam
https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Generators/N-5yc1vZbx8l
https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment/N-5yc1vZbx5c
https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Pressure-Washers/N-5yc1vZbxbe
https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Riding-Lawn-Mowers/N-5yc1vZc5ax
https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Snow-Removal-Equipment/N-5yc1vZbxau
https://www.homedepot.com/b/Outdoors-Outdoor-Power-Equipment-Trimmers-Edgers/N-5yc1vZbxbh
https://www.homedepot.com/b/Outdoors-Patio-Furniture/N-5yc1vZbx4o
https://www.homedepot.com/b/Outdoors-Pet-Supplies-Wildlife/N-5yc1vZc4u1
https://www.homedepot.com/b/Outdoors-Pools/N-5yc1vZcfyr
https://www.homedepot.com/b/Outdoors-Pools-Pool-Supplies/N-5yc1vZ1z18gxc
https://www.homedepot.com/b/Paint-Exterior-Paint/N-5yc1vZcg5u
https://www.homedepot.com/b/Paint-Exterior-Wood-Coatings/N-5yc1vZbbbr
https://www.homedepot.com/b/Paint-Interior-Paint/N-5yc1vZbbbp
https://www.homedepot.com/b/Paint-Interior-Wood-Stains/N-5yc1vZbo8p
https://www.homedepot.com/b/Paint/N-5yc1vZar2d
https://www.homedepot.com/b/Paint-Paint-Supplies/N-5yc1vZci1w
https://www.homedepot.com/b/Paint-Spray-Paint/N-5yc1vZapz5
https://www.homedepot.com/b/Playground-Sets/N-5yc1vZcjcd
https://www.homedepot.com/b/Plumbing/N-5yc1vZbqew
https://www.homedepot.com/b/Plumbing-Pipe-Fittings/N-5yc1vZbqpf
https://www.homedepot.com/b/Plumbing-Plumbing-Parts-Faucet-Parts/N-5yc1vZc6a9
https://www.homedepot.com/b/Plumbing-Plumbing-Parts/N-5yc1vZbqkp
https://www.homedepot.com/b/Plumbing-Plumbing-Tools/N-5yc1vZbqlq
https://www.homedepot.com/b/Plumbing-Water-Heaters/N-5yc1vZbqly
https://www.homedepot.com/b/Plumbing-Water-Pumps/N-5yc1vZbqlb
https://www.homedepot.com/b/Safety-Equipment/N-5yc1vZc4ow
https://www.homedepot.com/b/Smart-Home/N-5yc1vZc1jw
https://www.homedepot.com/b/Sports-Outdoors/N-5yc1vZc43l
https://www.homedepot.com/b/Storage-Organization-Closet-Organizers/N-5yc1vZc1x1
https://www.homedepot.com/b/Storage-Organization-Garage-Storage/N-5yc1vZarmi
https://www.homedepot.com/b/Storage-Organization-Moving-Supplies/N-5yc1vZc89r
https://www.homedepot.com/b/Storage-Organization/N-5yc1vZas7e
https://www.homedepot.com/b/Storage-Organization-Outdoor-Storage/N-5yc1vZbu96
https://www.homedepot.com/b/Storage-Organization-Shelving/N-5yc1vZc89k
https://www.homedepot.com/b/Tools-Air-Compressor-Tools/N-5yc1vZc2fh
https://www.homedepot.com/b/Tools-Hand-Tools/N-5yc1vZc1zg
https://www.homedepot.com/b/Tools/N-5yc1vZc1xy
https://www.homedepot.com/b/Tools-Power-Tool-Accessories/N-5yc1vZc246
https://www.homedepot.com/b/Tools-Power-Tools-Drills/N-5yc1vZc27f
https://www.homedepot.com/b/Tools-Power-Tools/N-5yc1vZc298
https://www.homedepot.com/b/Tools-Power-Tools-Saws/N-5yc1vZc28l
https://www.homedepot.com/b/Tools-Tool-Storage/N-5yc1vZc22e
https://www.homedepot.com/b/Tools-Welding-Soldering/N-5yc1vZc8lp
https://www.homedepot.com/b/Tools-Woodworking-Tools/N-5yc1vZc2gv
https://www.homedepot.com/b/Window-Treatments-Blinds/N-5yc1vZch24
https://www.homedepot.com/b/Window-Treatments/N-5yc1vZar4w
https://www.homedepot.com/b/Window-Treatments-Plantation-Shutters/N-5yc1vZar29
https://www.homedepot.com/b/Window-Treatments-Window-Shades/N-5yc1vZch27
https://www.homedepot.com/b/Workwear/N-5yc1vZc4ot
#+end_example

* Roam
+ [[id:aa3cc128-ef8a-47e0-afbd-b3afa93c366a][Workshop]]
+ [[id:7a4a7eea-5795-44e5-86e8-eec2afebf110][GraphQL]]
